---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetPaletteId(System.Int32)
source: html/cb8405ce-67de-cea2-abda-a83b2053e0fc.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetPaletteId Method

Set the fabrication palette identifier to change the elements to.

## Syntax (C#)
```csharp
public void SetPaletteId(
	int paletteId
)
```

## Parameters
- **paletteId** (`System.Int32`)